{
    "cpaPage": {
        "tabs": [
            {
                "id": 1,
                "tab": "Eligibility Checksss"
            },
            {
                "id": 2,
                "tab": "Licensing/ Licensure"
            },
            {
                "id": 3,
                "tab": "Preparations"
            },
            {
                "id": 4,
                "tab": "Career Opportunities"
            },
            {
                "id":5,
                "tab":"EXAM PATTERNS AND SCORES"
            }
        ],
        "description": [
            {
                "id": 1,
                "para": "The CPA Exams are administered by the AICPA, the world’s largest accounting body. The AICPA offers membership to all the aspirants who successfully clear all 4 CPA exams. A CPA license, however, is issued by the 55 state boards of accountancy in the US that are part of NASBA. Each state board has different eligibility criteria that need to be met by the aspirant in order to take the US CPA exams.",
                "paraone":"",
                "paraTwo": "Simandhar Education provides a free eligibility check that you could use to check if you’re eligible to take the prestigious US CPA certification.",
                "button": "Know Your Eligibility",
                "title": "General Rule of Thumb :",
                "title1": "",
                "mainheading":"",
                "lists": [
                    {
                        "id": 1,
                        "list": "Master’s Degree in any of the streams of Commerce, Accounting or Finance"
                    },
                    {
                        "id": 2,
                        "list": "An aspirant needs 120 credits to take the US CPA exams and 150 credits to get his CPA license."
                    },
                    {
                        "id": 3,
                        "list": "It’s considered that one year of University education in India is equal to 30 credits of US education."
                    },
                    {
                        "id": 4,
                        "list": "In some cases, first division graduates of a three-year degree from NAAC-A accredited universities of India are qualified to take the US CPA exams too."
                    }
                ],
                "lists1":[],
                "lists3":[]
            },
            {
                "id": 2,
                "para": "The NASBA (National Association of State Boards of Accountancy) and the state board of accountancy governs the eligibility rules of CPA. The CPA exam requirements vary by state jurisdiction. Every state board of accountancy has a different set of requirements, but most states have a core set of qualifications for a candidate to be eligible for the CPA exam.",
                "paraone":"",
                "paraTwo": "Besides the above requirements, the candidate must have a bachelor’s degree in Commerce/Accounting/Business with any of the below qualifications:",
                "button": "",
                "title": "Let’s go through the CPA license requirements.",
                "title1": "",
                "mainheading":"",
                "lists": [
                    {
                        "id": 1,
                        "list": "In general, many states ask for 150 credit hours in some specific courses from a university or an accredited institute under NASBA."
                    },
                    {
                        "id": 2,
                        "list": "The candidate should pass the Ethics exam."
                    },
                    {
                        "id": 3,
                        "list": "Must have 2,000 hours of work experience in taxation, auditing, accounting and management consultancy (need not be under a CPA supervisor, Mr.Sripal Jain (CA,CPA) can verify for you)."
                    },
                    {
                        "id": 4,
                        "list": "Age limit: 18+ years."
                    }
                ],
                "lists1": [
                    {
                        "id": 1,
                        "list": "Member of the “Institute of Costs & Works Accountants in India."
                    },
                    {
                        "id": 2,
                        "list": "Member of the “Institute of Chartered Accountants of India."
                    },
                    {
                        "id": 3,
                        "list": "Member of the “Company Secretaries in India."
                    },
                    {
                        "id": 4,
                        "list": "MBA."
                    },
                    {
                        "id": 5,
                        "list": "Master of Commerce.."
                    }
                ],
                "lists3":[]
            },
            {
                "id": 3,
                "para": "Simandhar Education has its own CPA exam review, taught by India’s best CPA instructors like Sripal Jain (CA, CGMA, US CPA), Surinder Kaur (CPA), Srikanth Tadikonda (CMA, CPA), Dhanashree Kshirsagar (CA, CPA), Heena Vithlani (CA,CPA,IFRS with ACCA), Karan Nathvani (CA,MBA-IIM Indore, CISA, CCSK) Amit Kumar Gupta (ACA,ACS,CMA) Sudha Murthy (CA) and Suraj Lakhotia (CA, CIMA). Simandhar has helped hundreds of CPA aspirants clear their CPA exams in India.",
                "paraone":"Simandhar CPA LMS coupled with Becker CPA review makes sure that you get all the nourishment required to tackle your CPA exams. The combination ensures that you leave no stone unturned. Along with the regular classes, Simandhar extends support to aspirants through revision classes that have been a hit for a long time among the Indian CPA fraternity.",
                "paraTwo": "",
                "button": "",
                "title": "General Rules of Thumb :",
                "title1": "General Rules of Thumb :",
                "mainheading":"Simandhar + Becker",
                "lists": [],
                "lists1":[],
                "lists3":[]
            },
            {
                "id": 4,
                "para": "",
                "paraone":"",
                "paraTwo": "With diverse industry relations and corporate tie-ups, Simandhar Education provides placement assistance to all its CPA learners.",
                "button": "",
                "title": "Career opportutities",
                "title1": "",
                "mainheading":"",
                "lists": [
                    {
                        "id": 1,
                        "list": "Consulting Services"
                    },
                    {
                        "id": 2,
                        "list": "Assurance Services"
                    },
                    {
                        "id": 3,
                        "list": "Financial Planning"
                    },
                    {
                        "id": 4,
                        "list": "International Accounting"
                    },
                    {
                        "id": 5,
                        "list": "Information Technology Services"
                    },
                    {
                        "id": 6,
                        "list": "Forensic Accounting"
                    },
                    {
                        "id": 7,
                        "list": "Litigation Services"
                    },
                    {
                        "id": 8,
                        "list": "Non-Profit Organizations"
                    },
                    {
                        "id": 9,
                        "list": "Taxation Services"
                    },
                    {
                        "id": 10,
                        "list": "Business Valuation And Many more"
                    }
                ],
                "lists1":[],
                "lists3":[]
            },
            {
                "id": 5,
                
                "title": null,
                "title1": null,
                "mainheading":"US CPA Exam Pattern and Passing Score",
                "lists": [],
                "lists1":[],
                "lists3":[
                    {
                        "id":1,
                        "question":"How exactly is the CPA exam scored and graded?",
                        "ans":"A candidate needs a 75 or more score to pass the CPA exam and become a Certified Public Accountant. According to AICPA, the CPA exam is scored on a scale of 0-99. Candidates usually get confused if those 75 scores are supposed to be 75 percent or points. It is necessary to understand that the candidate needs to achieve 75 points to clear the exam successfully."
                    },
                    {
                        "id":2,
                        "question":"Multiple-Choice Question Scoring:",
                        "ans":"The MCQ testlets use what’s called a multi-stage testing approach. This means that as the candidate keeps performing through each section, the level of difficulty of the next changes accordingly. If you perform really well in the first set of questions, the next set will be difficult ones. Difficult MCQs are weighted more than easy MCQs. Thus, one correctly answered difficult MCQ would improve your score more than several correctly answered easy MCQs."
                    },
                    {
                        "id":3,
                        "question":"Task-Based Simulation scoring:",
                        "ans":"These consist of problems that you need to solve based on situations and concepts. They are matching orfill={true} sizes='100vw' in the blank kind of questions"
                    },
                    {
                        "id":4,
                        "question":"Written Communication Scoring:",
                        "ans":"This tests your ability to perform communication tasks like demonstration and creative writing. Mostly the BEC section of the CPA exam has written communication and in this you have to type out the answer in a blank word document."
                    }
                ],
                "para": null,
                "paraone":null,
                "paraTwo": null,
                "button": null
            }
          
        ]
    }
}

