{
    
    "sripalJain": {
      "mainheading": "Sripal Jain in the USA with Industry Leaders",
      "maindescription": "Corporate Relationships have always been one of the biggest strengths of Simandhar Education. Our co-founder Mr. Sripal Jain, CA, CPA, has been travelling across the U.S. and meeting prominent leaders in the Finance and Accounting field. He has been developing exclusive relationships for recruiting, training, and placements. He has also been gaining insights on how to create a CPA ecosystem in India and upskill accounting aspirants to meet the global demand.",
      "boxes": [
        {
          "id": 0,
          "path": "/img/sripal_img01.webp",
          "heading": "Meet the Vice President, Mr. Kenneth Koskay and the Leadership Team of Becker Professional Education",
          "para": "Mr. Sripal Jain (CA, CPA) had the pleasure of meeting Mr. Kenneth Koskay (CPA, CFP), Vice President of Becker Professional Education along with the rest of the leadership team at Dallas, USA. They had a discussion which spanned across topics like adding value to CPA and CMA professionals in India, CPA Evolution, CPA and CMA career prospects in the US, and customized programs for licensed CPAs to meet the CPE credit requirements.  "
        },
        {
          "id": 1,
          "path": "/img/sripal_img02.webp",
          "heading": "Meet CS Devika Panda, Company Secretary of Devika Panda & Associates in Dallas, USA",
          "para": "Mr. Sripal Jain had an interaction with CS Devika Panda, Company Secretary of Devika Panda & Associates in Dallas, USA. They discussed topics like Data Analytics, Cybersecurity, and other emerging trends in Finance and Technology. She also expressed her gratitude towards Mr. Sripal for his guidance  "
        },
        {
          "id": 2,
          "path": "/img/sripal_img03.webp",
          "heading": "Meet Simandhar CPA and CMA Students",
          "para": "Mr. Sripal Jain met our CPA and CMA students in Seattle, USA, and discussed the CPA Exam 2024 changes with a special focus on cybersecurity, data analytics, and SOC reporting. He also gave tips to clear the CPA and CMA exams and enlightened them about emerging career opportunities. Our students showered their love and expressed their gratitude towards him with gifts.  "
        },
        {
          "id": 3,
          "path": "/img/sripal_img04.webp",
          "heading": "Meet Ms. Danielle Hologram, CAE, CEO of Kansas Society of CPAs",
          "para": "Mr. Sripal Jain met Ms. Danielle Hologram, CEO of Kansas Society of CPAs in Kansas, USA. They had a long discussion on CPA 2024 exam changes, talent challenges in accounting firms, CPA licensing requirements, and CPE programs for licensed CPAs  "
        },
        {
          "id": 4,
          "path": "/img/sripal_img05.webp",
          "heading": "Meet Dr. Sean Stein Smith DBA, CPA",
          "para": "Mr. Sripal Jain met Dr. Sean Stein Smith DBA, CPA who is an award-winning researcher and made it to the list of 40 under 40 Accounting Thought Leader. He is a blockchain enthusiast and the founder of Institute for Blockchain & Crypto asset Research. They spoke about the emergence of Blockchain technology and how it can disrupt the different fields including Finance & Accounting.  "
        },
        {
          "id": 5,
          "path": "/img/sripal_img06.webp",
          "heading": "AICPA Engage Conference 2022",
          "para": "Infinity Globus sponsored Mr. Sripal Jain for the 3-day AICPA Engage Event 2022 in Vegas, USA. This was an amazing gesture and an opportunity to learn, network, and meet many experts in the finance & accounting industry.  "
        },
        {
          "id": 6,
          "path": "/img/sripal_img07.webp",
          "heading": "Meeting Mr. Anoop Mehta, the New AICPA Chairman",
          "para": "Mr. Sripal Jain (CA, CPA ) met with newly appointed AICPA chairman Mr. Anoop Mehta at the AICPA engage event in Vegas, USA. He passed on wishes to Simandhar CPA course students and alumni who have cleared their CPA exam. They discussed ways to support US CPA licensed professionals in India by upskilling them and adopting AICPA CPE programs in order to develop a CPA ecosystem in the country.  "
        },
        {
          "id": 7,
          "path": "/img/Mr._Dario_Grassini.webp",
          "heading": "Meeting Mr. Dario Grassini, CEO of SAPRO",
          "para": "Dario Grassini - CEO, SAPRO and Mr. Sripal Jain met at the AICPA engage meeting in Las Vegas and discussed at length opportunities for CPAs and EAs in SAPRO ,expansion plans of SAPRO in India and how Simandhar Education could support in US GAAP, US tax and other customised training for talented professionals of SAPRO In India.  "
        },
        {
          "id": 8,
          "path": "/img/Mr._Jeremy_Dillard.webp",
          "heading": "Meeting Mr. Jeremy Dillard, CPA, CGMA",
          "para": "Mr.Sripal Jain (CA, CPA ) had a wonderful time meeting Jeremy Dillard CPA, CGMA at the AICPA engage event in Vegas. He is a member of Private company council, which advises the Financial Accounting Standards Board (FASB) on changes to GAAP for private companies."
        },
        {
          "id": 9,
          "path": "/img/tom_hood.webp",
          "heading": "Meeting Mr. Tom Hood, CPA,CITP,CGMA",
          "para": "Mr. Sripal Jain (CA, CPA ) had the pleasure of connecting with Tom Hood, CPA,CITP,CGMA in Las Vegas, USA. They talked about the opportunities for CPAs in India and how the partnership between Simandhar Educationand the AICPA for data analytics and other tech certifications is adding value to accounting professionals in India.  "
        },
        {
          "id": 10,
          "path": "/img/Carla_Harris.webp",
          "heading": "Meeting Ms. Carla Harris, Managing Director at Morgan Stanley",
          "para": "Mr. Sripal Jian had the pleasure to listen to Carla Harris (Managing director, Morgan Stanley ) speak on intellectual leadership at the AICPA engage event in Las Vegas, USA, where she talked about the 8 pearls of Intellectual leadership, building trust, owning your mistakes and being authentic.  "
        },
        {
          "id": 11,
          "path": "/img/Sharon_Kreider.webp",
          "heading": "Meeting Ms. Sharon Kreider, CPA, EA",
          "para": "Mr.Sripal Jain (CA, CPA ) meets with Sharon Kreider at the #aicpaengage event in Las Vegas, USA, to discuss important taxation points and the complexity in Individual taxation. Sharon is nationally known as one of the top speakers in the field of taxation and also a recipient of the AICPA Sidney Kess award for excellence in Continuing education.  "
        },
        {
          "id": 12,
          "path": "/img/Madhu_Bayana.webp",
          "heading": "Meeting Mr. Madhu Bayana, Director-Finance & Operations at Microsoft Campus",
          "para": "Mr. Sripal Jain joins Mr. Madhu Bayana, Director-Finance & Operations-Microsoft to discuss the future of finance, emerging technologies, and opportunities for CPA professionals to not only work in finance but also how they could contribute to business partnering, analytics, and decision support systems.  "
        },
        {
          "id": 13,
          "path": "/img/Alumni_at_Microsoft.webp",
          "heading": "Meet-up with Alumni at Microsoft",
          "para": "Mr.Sripal Jain (CA, CPA ) met with Ms. Akil Thara at the Microsoft Campus in Seattle, USA. They discussed about CPA professionals' contribution in the field of data analytics and opportunities all over the world. They also explored different ways on how data analytics can be included in the CPA course curriculum.  "
        },
        {
          "id": 14,
          "path": "/img/Shaping_Up_Students.webp",
          "heading": "Shaping Up Students’ Lives",
          "para": "From passion of building one’s career in Finance to making that dream come true for every CPA course student, the conversations between Mr. Sripal Jain and Simandhar’s Alumna Mrs. Indumathi Chandrasekharan were flowing.  "
        },
        {
          "id": 15,
          "path": "/img/Visiting_AICPA_Headquarters.webp",
          "heading": "Visiting AICPA Headquarters, New York",
          "para": "Mr. Sripal Jain visited the AICPA headquarters in New York and met the entire leadership team. American Institute of Certified Public Accountants is the regulatory body of CPA that evaluates the Uniform CPA exam, provides educational materials, and enforces standards within the CPA profession. Mr. Sripal and Mr. Michael Decker (VP- AICPA examination) discussed on 2024 AICPA model and ways to support CPA aspirants and licensed CPA professionals in India.  "
        },
        {
          "id": 16,
          "path": "/img/Mr._Ken_L.Bishop.webp",
          "heading": "Meeting Mr. Ken L. Bishop, President and CEO of NASBA, Nashville",
          "para": "Mr. Sripal Jain was invited for lunch by NASBA in Nashville, USA. NASBA (National Association of State Boards of Accountancy) provides inputs to AICPA and regulates the accountancy profession in the USA. He met the President and CEO of NASBA, Mr. Ken L. Bishop and the entire NASBA team and discussed about US CPA exam in India, CPA eligibility, evaluation requirements, CPA licensing and CPA evolution 2024.  "
        },
        {
          "id": 17,
          "path": "/img/Meeting_EY_Leadership.webp",
          "heading": "Meeting EY Leadership Team at EY Campus, New York",
          "para": "Mr. Sripal Jain met Ashu Rathor (CPA, MBA, MS) and Lisa Lim (Global Tax Account Leader) and explored different ways to support EY through employee training and upskilling. We are exclusive partners of EY for CPA training and many of our alumni have been placed in EY in different job profiles.  "
        }
      ]
    }
  }